In [1]:
import pandas as pd
import numpy as np

In [2]:
# doc file cvs tren may
df = pd.read_csv('data_for_test_10000.csv' , sep = '\t')

In [3]:
df

     ,ID,Fullname,Birthday,Sex,Hometown,Jobtype,Salary,Marital Status
0     0,123456789012,Nguyen Van A,12/09/1985,Male,Tr...
1     1,123456789012,Nguyen Van Anh,15/08/1990,Male,...
2     2,123456789012,Nguyen Van Anh,20/07/1985,Femal...
3     3,123456789012,Trần Thị Minh Thu,12/05/1987,fe...
4     4,123456789012,Nguyễn Văn A,20/03/1990,Male,Bà...
...                                                 ...
9995  9995,123456789012,Nguyen Van Anh,26/07/1992,Ma...
9996  9996,493091448434,Nguyen Van Anh,18/07/1990,ma...
9997  9997,123456789012,Nguyễn Thị Thanh Thúy,12/08/...
9998  9998,123456789123,Nguyen Van A,12/06/1987,Male...
9999  9999,123456789012,Nguyễn Văn Hùng,26/03/1985,M...

[10000 rows x 1 columns]

In [4]:
df.head()

  ,ID,Fullname,Birthday,Sex,Hometown,Jobtype,Salary,Marital Status
0  0,123456789012,Nguyen Van A,12/09/1985,Male,Tr...
1  1,123456789012,Nguyen Van Anh,15/08/1990,Male,...
2  2,123456789012,Nguyen Van Anh,20/07/1985,Femal...
3  3,123456789012,Trần Thị Minh Thu,12/05/1987,fe...
4  4,123456789012,Nguyễn Văn A,20/03/1990,Male,Bà...

In [5]:
df.shape()

TypeError: 'tuple' object is not callable

In [6]:
df.shape

(10000, 1)

In [7]:
list(df.columns)

[',ID,Fullname,Birthday,Sex,Hometown,Jobtype,Salary,Marital Status']

In [8]:
df.describe()

       ,ID,Fullname,Birthday,Sex,Hometown,Jobtype,Salary,Marital Status
count                                               10000
unique                                              10000
top     0,123456789012,Nguyen Van A,12/09/1985,Male,Tr...
freq                                                    1

In [9]:
df.loc(df.Fullname = str.isalpha())

SyntaxError: expression cannot contain assignment, perhaps you meant "=="? (3778838322.py, line 1)

In [10]:
df.loc(df.Fullname == str.isalpha())

AttributeError: 'DataFrame' object has no attribute 'Fullname'

In [1]:
for index, row in df.iterrows():
    df.at[index, 'Fullname'] = ''.join(filter(str.isalpha, row['Fullname']))

NameError: name 'df' is not defined

In [ ]:
df